In [2]:
import pandas as pd
import pymysql.cursors

In [3]:
#Importing CSV and JSON  Data
account_data = pd.read_csv("Data/accounts.csv")
branch_data = pd.read_csv("Data/branches.csv")
customers_data = pd.read_csv("Data/customers.csv")
loans_data = pd.read_csv("Data/loans.csv")
support_tickets_data = pd.read_csv("Data/support_tickets.csv")
transactions_data = pd.read_csv("Data/transactions.csv")
creditCard_Data = pd.read_json("Data/credit_cards.json")

In [59]:
account_data.head()

  customer_id  account_balance         last_updated
0       C0001        293729.87  2025-05-24 09:46:29
1       C0002        150735.15  2025-05-24 09:46:29
2       C0003        170156.21  2025-05-24 09:46:29
3       C0004        311383.96  2025-05-24 09:46:29
4       C0005         60320.75  2025-05-24 09:46:29

In [60]:
account_data.isnull().sum()

customer_id        0
account_balance    0
last_updated       0
dtype: int64

In [6]:
branch_data.head()

,Branch_ID,Branch_Name,City,Manager_Name,Total_Employees,Branch_Revenue,Opening_Date,Performance_Rating
0,1,"Wang, Mcdonald and Church Branch",Kellitown,Kevin Jones,141,16849288.09,2008-08-01,2
1,2,Crawford-Torres Branch,Angelaburgh,Andrea Steele,39,5822279.32,2015-09-17,1
2,3,Bridges Inc Branch,Johnsonfort,Michael Coleman,195,2114594.03,2012-07-30,3
3,4,Garcia Group Branch,New Kyleberg,Dawn Cooper,144,3390389.63,2018-06-27,2
4,5,"Arroyo, Moore and Freeman Branch",West Coryborough,Samantha Kennedy,42,2771910.11,2012-01-04,5

In [7]:
branch_data.isnull().sum()

Branch_ID             0
Branch_Name           0
City                  0
Manager_Name          0
Total_Employees       0
Branch_Revenue        0
Opening_Date          0
Performance_Rating    0
dtype: int64

In [8]:
customers_data.head()

,customer_id,name,gender,age,city,account_type,join_date
0,C0001,Richard Wilson,M,65,Kimberlyburgh,Savings,2023-08-27
1,C0002,Holly Parker,F,41,Port David,Current,2023-12-08
2,C0003,Megan Alvarez,M,46,West Laurieton,Savings,2022-05-25
3,C0004,Nicholas Stewart,F,39,Amyville,Current,2020-11-30
4,C0005,Douglas Anderson,M,70,New Craigport,Current,2023-01-29

In [9]:
customers_data.isnull().sum()

customer_id     0
name            0
gender          0
age             0
city            0
account_type    0
join_date       0
dtype: int64

In [10]:
loans_data.head()

,Loan_ID,Customer_ID,Account_ID,Branch,Loan_Type,Loan_Amount,Interest_Rate,Loan_Term_Months,Start_Date,End_Date,Loan_Status
0,1,1559,2090,Perez Ltd Branch,Personal,259805,12.43,60,2017-07-03,2022-06-07,Active
1,2,1028,2575,Harris-Marshall Branch,Business,3589336,6.75,24,2017-06-14,2019-06-04,Active
2,3,1164,2433,"Taylor, David and Brown Branch",Auto,4621300,9.86,240,2021-08-10,2041-04-27,Closed
3,4,1100,2368,Robertson and Sons Branch,Home,2380953,7.74,120,2016-02-23,2026-01-01,Approved
4,5,1081,2566,"Parrish, Hall and Adams Branch",Home,2268961,12.96,240,2021-01-05,2040-09-22,Approved

In [11]:
loans_data.isnull().sum()

Loan_ID             0
Customer_ID         0
Account_ID          0
Branch              0
Loan_Type           0
Loan_Amount         0
Interest_Rate       0
Loan_Term_Months    0
Start_Date          0
End_Date            0
Loan_Status         0
dtype: int64

In [21]:
support_tickets_data.head()

,Ticket_ID,Customer_ID,Account_ID,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating
0,T00001,C0478,A1825,NaN,Gonzalez-Martin Branch,Loan Payment Delay,Client raised loan payment delay.,2017-09-30,2017-10-24,Low,Closed,Card replaced and activated.,Leena Apte,Email,1
1,T00002,C0443,A3583,NaN,Baldwin and Sons Branch,Loan Foreclosure,Client raised loan foreclosure.,2015-04-19,2015-05-12,Critical,In Progress,Card replaced and activated.,Owen Mahajan,In-person,1
2,T00003,C0057,A2616,442.0,"Porter, Osborne and Mendez Branch",Interest Rate Dispute,Customer reported interest rate dispute.,2016-09-28,2016-10-23,High,Resolved,Loan schedule updated.,Wishi Chhabra,Email,4
3,T00004,C0301,A8786,NaN,"Stafford, Oneal and Williams Branch",Mismatch in Account Statement,Client raised mismatch in account statement.,2019-03-31,2019-04-10,High,Closed,Pending customer verification.,Gabriel Mutti,Email,1
4,T00005,C0238,A3734,NaN,Evans-Mercado Branch,KYC Update Required,System detected kyc update required.,2017-08-11,NaN,Critical,Resolved,Pending customer verification.,Ekani Oza,In-person,2

In [8]:
transactions_data.head()

   txn_id customer_id    txn_type    amount             txn_time   status
0  T00001       C0363     deposit  44442.71  2025-02-14 06:26:00  success
1  T00002       C0432     deposit  15737.59  2025-03-27 07:21:21  success
2  T00003       C0084  withdrawal  82150.70  2024-07-31 18:28:06  success
3  T00004       C0067  withdrawal  20313.86  2024-11-11 12:18:47  success
4  T00005       C0485  withdrawal  74536.08  2025-04-15 10:52:59  success

In [9]:
creditCard_Data.head()

,Card_ID,Customer_ID,Account_ID,Branch,Card_Number,Card_Type,Card_Network,Credit_Limit,Current_Balance,Issued_Date,Expiry_Date,Status
0,1,1559,2090,Perez Ltd Branch,4960013389083863,Business,Visa,178393,39819.23,2015-04-13,2019-10-27,Expired
1,2,1160,2221,Miller Inc Branch,6511615594078161,Platinum,RuPay,416026,175818.58,2015-01-27,2018-12-18,Expired
2,3,1297,2082,"Miles, Patterson and Murray Branch",6316475255341928,Gold,RuPay,419398,29171.29,2021-06-22,2025-07-19,Active
3,4,1333,2058,"Shepard, Gonzales and Cooper Branch",3305641395376724,Gold,Amex,385544,265316.71,2019-04-04,2023-10-07,Active
4,5,1371,2225,Wilson PLC Branch,6287101226916697,Platinum,RuPay,274622,246561.92,2023-05-18,2029-08-26,Expired

In [37]:
support_tickets_data.isnull().sum()
# Loan Id and Date closed is null.

Ticket_ID             0
Customer_ID           0
Account_ID            0
Loan_ID               0
Branch_Name           0
Issue_Category        0
Description           0
Date_Opened           0
Date_Closed           0
Priority              0
Status                0
Resolution_Remarks    0
Support_Agent         0
Channel               0
Customer_Rating       0
dtype: int64

In [ ]:
support_tickets_data[support_tickets_data['Loan_ID'].isna()]

support_tickets_data['Loan_ID'] = support_tickets_data['Loan_ID'].fillna('-')
support_tickets_data['Date_Closed'] = support_tickets_data['Date_Closed'].fillna(None)

support_tickets_data

,Ticket_ID,Customer_ID,Account_ID,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating
0,T00001,C0478,A1825,-,Gonzalez-Martin Branch,Loan Payment Delay,Client raised loan payment delay.,2017-09-30,2017-10-24,Low,Closed,Card replaced and activated.,Leena Apte,Email,1
1,T00002,C0443,A3583,-,Baldwin and Sons Branch,Loan Foreclosure,Client raised loan foreclosure.,2015-04-19,2015-05-12,Critical,In Progress,Card replaced and activated.,Owen Mahajan,In-person,1
2,T00003,C0057,A2616,442.0,"Porter, Osborne and Mendez Branch",Interest Rate Dispute,Customer reported interest rate dispute.,2016-09-28,2016-10-23,High,Resolved,Loan schedule updated.,Wishi Chhabra,Email,4
3,T00004,C0301,A8786,-,"Stafford, Oneal and Williams Branch",Mismatch in Account Statement,Client raised mismatch in account statement.,2019-03-31,2019-04-10,High,Closed,Pending customer verification.,Gabriel Mutti,Email,1
4,T00005,C0238,A3734,-,Evans-Mercado Branch,KYC Update Required,System detected kyc update required.,2017-08-11,None,Critical,Resolved,Pending customer verification.,Ekani Oza,In-person,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
595,T00596,C0303,A9594,-,Johnson Group Branch,Account Frozen,Customer reported account frozen.,2015-03-08,2015-03-30,Medium,Escalated,Issue resolved successfully.,Chaitaly Vaidya,Mobile App,3
596,T00597,C0480,A5144,-,Clark Inc Branch,Interest Rate Dispute,Customer reported interest rate dispute.,2020-01-17,2020-01-26,Medium,In Progress,Issue resolved successfully.,Ekapad Jhaveri,In-person,1
597,T00598,C0270,A7108,427.0,Murphy-Johnston Branch,Interest Rate Dispute,Client raised interest rate dispute.,2016-04-22,2016-05-13,Critical,Resolved,Loan schedule updated.,Advik Bhagat,In-person,4
598,T00599,C0144,A4959,121.0,"Herrera, Rollins and Hill Branch",Card Not Working,Customer reported card not working.,2015-02-26,2015-03-25,Low,In Progress,Card replaced and activated.,Wriddhish Sarraf,Phone,2
599,T00600,C0076,A7140,24.0,Peterson-Graves Branch,EMI Auto-debit Failed,Customer reported emi auto-debit failed.,2023-08-19,2023-09-04,Critical,Escalated,Card replaced and activated.,Ria Ghose,Mobile App,5

In [4]:
DB_CONFIG = {
    "host": "localhost",
    "user": "root",       
    "password": "root",  
    "database": "banksight",  
     "port": 3306,
    "charset": "utf8mb4",
    "cursorclass": pymysql.cursors.DictCursor
}

In [5]:
def get_connection():
    return pymysql.connect(**DB_CONFIG)

In [75]:
#Account Table Creation
account_table_sql = """
CREATE TABLE IF NOT EXISTS accounts (
    customer_id varchar(50)  PRIMARY KEY,
    account_balance DECIMAL(12,2),
    last_updated TIMESTAMP  
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(account_table_sql)
    connection.commit()
    print("Account Table created successfully")
finally:
    connection.close()

Account Table created successfully

In [76]:
#Inserting Account Table Data
insert_sql = """
INSERT INTO accounts (customer_id, account_balance, last_updated)
VALUES (%s, %s, %s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in account_data.iterrows():
            cursor.execute(insert_sql, (row['customer_id'], row['account_balance'], row['last_updated']))
    connection.commit()
    print(f"âœ… Inserted Account Data  successfully")
finally:
    connection.close()

âœ… Inserted Account Data  successfully

In [64]:
#Selecting  Account Table Data
select_sql = """
SELECT * FROM accounts 
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(select_sql)
        rows = cursor.fetchall()
        PD = pd.DataFrame(rows)
        print(PD)      
finally:
    connection.close()

    customer_id account_balance        last_updated
0         C0001       293729.87 2025-05-24 09:46:29
1         C0002       150735.15 2025-05-24 09:46:29
2         C0003       170156.21 2025-05-24 09:46:29
3         C0004       311383.96 2025-05-24 09:46:29
4         C0005        60320.75 2025-05-24 09:46:29
..          ...             ...                 ...
495       C0496       149135.80 2025-05-24 09:46:29
496       C0497       376153.36 2025-05-24 09:46:29
497       C0498       320254.17 2025-05-24 09:46:29
498       C0499       484758.19 2025-05-24 09:46:29
499       C0500       454127.94 2025-05-24 09:46:29

[500 rows x 3 columns]

In [79]:
#Branch Table Creation
#Branch_ID,Branch_Name,City,Manager_Name,Total_Employees,Branch_Revenue,Opening_Date,Performance_Rating

Branch_table_sql = """
CREATE TABLE IF NOT EXISTS branches (
    Branch_ID INT  PRIMARY KEY,
    Branch_Name varchar(50),
    City varchar(50),
    Manager_Name varchar(50),
    Total_Employees  varchar(50),
    Branch_Revenue DECIMAL(12,2),
    Opening_Date TIMESTAMP,
    Performance_Rating INT
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(Branch_table_sql)
    connection.commit()
    print("Branch Table created successfully")
finally:
    connection.close()

Branch Table created successfully

In [80]:
#Inserting Branches Table Data
insert_sql = """
INSERT INTO branches (Branch_ID, Branch_Name, City,Manager_Name,Total_Employees,Branch_Revenue,Opening_Date,Performance_Rating)
VALUES (%s, %s, %s,%s, %s, %s,%s, %s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in branch_data.iterrows():
            cursor.execute(insert_sql, (row['Branch_ID'], row['Branch_Name'], row['City'],row['Manager_Name'], row['Total_Employees'], row['Branch_Revenue'],row['Opening_Date'], row['Performance_Rating']))
    connection.commit()
    print(f"âœ… Inserted Branches Data  successfully")
finally:
    connection.close()

âœ… Inserted Branches Data  successfully

In [81]:
#Customers  Table Creation
#customer_id,name,gender,age,city,account_type,join_date
Customer_table_sql = """
CREATE TABLE IF NOT EXISTS customers (
    customer_id varchar(50)  PRIMARY KEY,
    name varchar(50),
    gender varchar(50),
    age  INT,
    city varchar(50),
    account_type varchar(50),
    join_date TIMESTAMP,
    FOREIGN KEY (customer_id) REFERENCES accounts(customer_id)
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(Customer_table_sql)
    connection.commit()
    print("Customers Table created successfully")
finally:
    connection.close()

Customers Table created successfully

In [82]:
#Inserting Customers Table Data
#customer_id,name,gender,age,city,account_type,join_date
insert_sql = """
INSERT INTO customers (customer_id, name, gender,age,city,account_type,join_date)
VALUES (%s, %s, %s,%s, %s, %s,%s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in customers_data.iterrows():
            cursor.execute(insert_sql, (row['customer_id'], row['name'], row['gender'],row['age'], row['city'], row['account_type'],row['join_date']))
    connection.commit()
    print(f"âœ… Inserted Customers Data  successfully")
finally:
    connection.close()

âœ… Inserted Customers Data  successfully

In [83]:
#Transaction  Table Creation
#txn_id,customer_id,txn_type,amount,txn_time,status
Transaction_table_sql = """
CREATE TABLE IF NOT EXISTS transaction (
    txn_id varchar(50)  PRIMARY KEY,
    customer_id  varchar(50),
    txn_type  varchar(50),
    amount  DECIMAL(12,2),
    txn_time  TIMESTAMP,
    status   varchar(50),
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(Transaction_table_sql)
    connection.commit()
    print("Transaction Table created successfully")
finally:
    connection.close()

Transaction Table created successfully

In [84]:
#Transaction Table Data
#txn_id,customer_id,txn_type,amount,txn_time,status
insert_sql = """
INSERT INTO transaction (txn_id, customer_id, txn_type,amount,txn_time,status)
VALUES (%s, %s, %s,%s, %s, %s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in transactions_data.iterrows():
            cursor.execute(insert_sql, (row['txn_id'], row['customer_id'], row['txn_type'],row['amount'], row['txn_time'], row['status']))
    connection.commit()
    print(f"âœ… Inserted Transaction Data  successfully")
finally:
    connection.close()

âœ… Inserted Transaction Data  successfully

In [15]:
#Support Ticket  Table Creation
#Ticket_ID,Customer_ID,Account_ID,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating
support_ticket_table_sql = """
CREATE TABLE IF NOT EXISTS support_tickets (
    Ticket_ID varchar(50)  PRIMARY KEY,
    customer_id  varchar(50),
    account_id  varchar(50),
    Loan_ID  varchar(50),
    Branch_Name  varchar(50),
    Issue_Category   varchar(50),
    Description   varchar(50),
    Priority   varchar(50),
    Date_Opened  TIMESTAMP,
    Date_Closed   TIMESTAMP,
    status   varchar(50),
    Resolution_Remarks   varchar(50),
    Support_Agent    varchar(50),
    Channel    varchar(50),
    Customer_Rating    INT,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(support_ticket_table_sql)
    connection.commit()
    print("Support Ticket Table created successfully")
finally:
    connection.close()

Support Ticket Table created successfully

In [ ]:
#Support Tickets Table Data
#Ticket_ID,Customer_ID,Account_ID,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating

insert_sql = """
INSERT INTO support_tickets (Ticket_ID,customer_id,account_id,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating)
VALUES (%s, %s, %s,%s, %s, %s,%s, %s, %s,%s, %s, %s,%s, %s, %s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in support_tickets_data.iterrows():
            cursor.execute(insert_sql, (row['Ticket_ID'], row['Customer_ID'], row['Account_ID'], None if pd.isna(row['Loan_ID']) else row['Loan_ID'], row['Branch_Name'], row['Issue_Category'],row['Description'], row['Date_Opened'], row['Date_Closed'],row['Priority'], row['Status'], row['Resolution_Remarks'],row['Support_Agent'],row['Channel'],row['Customer_Rating']))
    connection.commit()
    print(f"âœ… Inserted Support Tickets Data successfully")
finally:
    connection.close()

-
-
442.0
-
-
-
-
58.0
-
-
-
-
-
-
296.0
-
-
528.0
-
-
-
-
364.0
211.0
-
-
-
-
-
-
297.0
-
549.0
-
-
234.0
-
234.0
339.0
-
-
-
-
118.0
231.0
-
-
-
-
-
392.0
-
393.0
199.0
-
-
424.0
256.0
-
334.0
-
423.0
-
43.0
-
-
-
343.0
-
-
-
429.0
-
-
-
-
-
-
-
-
-
98.0
541.0
-
-
404.0
61.0
544.0
-
208.0
436.0
-
513.0
-
-
102.0
-
512.0
-
407.0
-
431.0
101.0
-
477.0
461.0
-
-
-
-
180.0
289.0
-
-
90.0
553.0
-
-
119.0
-
-
-
163.0
-
309.0
-
-
83.0
-
393.0
-
-
-
-
-
-
182.0
-
-
-
-
-
354.0
225.0
-
-
-
-
-
-
387.0
452.0
545.0
-
-
297.0
-
-
319.0
-
-
-
-
-
43.0
-
280.0
221.0
-
-
412.0
-
345.0
-
-
211.0
228.0
-
-
-
-
-
472.0
-
445.0
-
370.0
48.0
-
51.0
-
-
-
-
-
-
373.0
261.0
16.0
-
-
219.0
-
406.0
-
-
425.0
412.0
69.0
189.0
-
-
-
501.0
423.0
516.0
-
528.0
-
-
-
457.0
319.0
-
-
-
94.0
328.0
535.0
536.0
-
-
-
-
-
488.0
-
-
-
416.0
439.0
133.0
27.0
549.0
-
-
398.0
-
-
-
482.0
-
154.0
-
117.0
16.0
-
541.0
227.0
451.0
300.0
24.0
-
94.0
-
530.0
-
136.0
167.0
485.0
-
-
367.0
-
-
372.0
-
-
-
171.0
-
425.0
-
-
-
-
-
179.0
500.0
458.0
340.0
-
-
-
166.0
-
116.0
-
-
-
-
-
-
-
-
-
-
-
291.0
211.0
395.0
-
-
-
27.0
63.0
435.0
-
-
-
-
136.0
-
-
-
-
525.0
474.0
-
-
-
28.0
420.0
341.0
-
-
-
90.0
424.0
-
209.0
-
101.0
-
153.0
-
-
475.0
518.0
412.0
493.0
203.0
477.0
-
-
-
-
-
-
-
-
-
-
-
-
-
284.0
-
-
-
-
-
499.0
-
452.0
352.0
456.0
-
447.0
-
-
370.0
-
-
-
-
-
-
460.0
-
3.0
-
346.0
110.0
-
-
291.0
521.0
-
-
371.0
-
-
-
-
-
365.0
410.0
-
-
323.0
-
-
190.0
474.0
116.0
-
-
-
-
426.0
-
-
-
-
542.0
-
-
-
-
16.0
43.0
119.0
-
-
499.0
-
34.0
-
87.0
-
470.0
-
104.0
319.0
-
456.0
-
-
-
-
119.0
-
-
5.0
219.0
-
-
-
-
-
-
103.0
50.0
536.0
-
-
-
-
-
-
-
-
-
-
-
483.0
220.0
-
-
-
133.0
-
-
-
-
-
-
465.0
14.0
-
-
-
-
1.0
478.0
-
233.0
243.0
35.0
286.0
358.0
-
174.0
206.0
-
-
-
387.0
-
370.0
373.0
-
-
541.0
85.0
-
421.0
-
339.0
-
-
-
234.0
182.0
471.0
34.0
-
-
88.0
-
237.0
-
-
74.0
-
-
-
-
-
494.0
190.0
51.0
-
520.0
-
-
505.0
-
-
533.0
-
-
-
-
413.0
-
388.0
-
430.0
-
-
402.0
-
-
-
-
-
-
-
-
-
-
370.0
-
-
303.0
-
-
442.0
297.0
350.0
493.0
-
-
-
-
-
-
350.0
141.0
119.0
-
20.0
-
-
-
427.0
121.0
24.0
âœ… Inserted Support Tickets Data successfully

In [42]:
#Credit Cards  Table Creation
    # {
    #     "Card_ID": 1,
    #     "Customer_ID": 1559,
    #     "Account_ID": 2090,
    #     "Branch": "Perez Ltd Branch",
    #     "Card_Number": "4960013389083863",
    #     "Card_Type": "Business",
    #     "Card_Network": "Visa",
    #     "Credit_Limit": 178393,
    #     "Current_Balance": 39819.23,
    #     "Issued_Date": "2015-04-13",
    #     "Expiry_Date": "2019-10-27",
    #     "Status": "Expired"
    # },
Credit_Cards_table_sql = """
CREATE TABLE IF NOT EXISTS credit_cards (
    Card_ID INT  PRIMARY KEY,
    Customer_ID  varchar(50),
    Account_ID  varchar(50),
    Branch  varchar(50),
    Card_Number  varchar(50),
    Card_Type   varchar(50),
    Card_Network   varchar(50),
    Credit_Limit   INT,
    Current_Balance  INT,
    Issued_Date   varchar(50),
    Expiry_Date   varchar(50),
    Status   varchar(50)
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(Credit_Cards_table_sql)
    connection.commit()
    print("Credit_Cards  Table created successfully")
finally:
    connection.close()

Credit_Cards  Table created successfully

In [43]:
#Support Tickets Table Data
    # {
    #     "Card_ID": 1,
    #     "Customer_ID": 1559,
    #     "Account_ID": 2090,
    #     "Branch": "Perez Ltd Branch",
    #     "Card_Number": "4960013389083863",
    #     "Card_Type": "Business",
    #     "Card_Network": "Visa",
    #     "Credit_Limit": 178393,
    #     "Current_Balance": 39819.23,
    #     "Issued_Date": "2015-04-13",
    #     "Expiry_Date": "2019-10-27",
    #     "Status": "Expired"
    # },
insert_sql = """
INSERT INTO credit_cards (Card_ID,Customer_ID,Account_ID,Branch,Card_Number,Card_Type,Card_Network,Credit_Limit,Current_Balance,Issued_Date,Expiry_Date,Status)
VALUES (%s, %s, %s,%s, %s, %s,%s, %s, %s,%s, %s, %s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in creditCard_Data.iterrows():
            cursor.execute(insert_sql, (row['Card_ID'], row['Customer_ID'], row['Account_ID'], row['Branch'], row['Card_Number'],row['Card_Type'], row['Card_Network'], row['Credit_Limit'],row['Current_Balance'], row['Issued_Date'], row['Expiry_Date'],row['Status']))
    connection.commit()
    print(f"âœ… Inserted Credit Card Data successfully")
finally:
    connection.close()

âœ… Inserted Credit Card Data successfully

In [44]:
#Loans  Table Creation
#Loan_ID,Customer_ID,Account_ID,Branch,Loan_Type,Loan_Amount,Interest_Rate,Loan_Term_Months,Start_Date,End_Date,Loan_Status
#1,1559,2090,Perez Ltd Branch,Personal,259805,12.43,60,2017-07-03,2022-06-07,Active

loans_table_sql = """
CREATE TABLE IF NOT EXISTS loans (
    Loan_ID INT  PRIMARY KEY,
    Customer_ID  varchar(50),
    Account_ID  varchar(50),
    Branch  varchar(50),
    Loan_Type  varchar(50),
    Loan_Amount   varchar(50),
    Interest_Rate   DECIMAL(12,2),
    Loan_Term_Months   INT,
    Start_Date   varchar(50),
    End_Date   varchar(50),
    Loan_Status   varchar(50)
)
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(loans_table_sql)
    connection.commit()
    print("Loans  Table created successfully")
finally:
    connection.close()

Loans  Table created successfully

In [46]:
#Loans Table Data
#Loan_ID,Customer_ID,Account_ID,Branch,Loan_Type,Loan_Amount,Interest_Rate,Loan_Term_Months,Start_Date,End_Date,Loan_Status
#1,1559,2090,Perez Ltd Branch,Personal,259805,12.43,60,2017-07-03,2022-06-07,Active

insert_sql = """
INSERT INTO loans (Loan_ID,Customer_ID,Account_ID,Branch,Loan_Type,Loan_Amount,Interest_Rate,Loan_Term_Months,Start_Date,End_Date,Loan_Status)
VALUES (%s, %s, %s,%s, %s, %s,%s, %s, %s,%s, %s)
"""

connection = get_connection()
try:
    with connection.cursor() as cursor:
        for index, row in loans_data.iterrows():
            cursor.execute(insert_sql, (row['Loan_ID'], row['Customer_ID'], row['Account_ID'], row['Branch'], row['Loan_Type'],row['Loan_Amount'], row['Interest_Rate'], row['Loan_Term_Months'],row['Start_Date'], row['End_Date'], row['Loan_Status']))
    connection.commit()
    print(f"âœ… Inserted Loans Data successfully")
finally:
    connection.close()

âœ… Inserted Loans Data successfully

In [11]:
# Q1: How many customers exist per city, and what is their average account balance?
query = """
SELECT 
c.city, 
count(  c.customer_id) as `Customer Count Per City`,
round(AVG(a.account_balance),2) AS `Average Account Balance`
FROM customers c
JOIN accounts a
    ON c.customer_id = a.customer_id
GROUP BY c.city
ORDER BY `Customer Count Per City` DESC
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

                   city  Customer Count Per City Average Account Balance
0            Port David                        3               209838.98
1          Jessicamouth                        3               312313.05
2    South Jenniferberg                        2               234996.50
3          Kimberlyfort                        2               405370.20
4             Jonesland                        2               281788.73
..                  ...                      ...                     ...
482          Mullenland                        1               149135.80
483         Shermanfurt                        1               376153.36
484        Nataliemouth                        1               320254.17
485          Millerstad                        1               484758.19
486    South Louismouth                        1               454127.94

[487 rows x 3 columns]

In [ ]:
# Q1: How many customers exist per city, and what is their average account balance?
query = """
SELECT 
c.city, 
count(  c.customer_id) as `Customer Count Per City`,
round(AVG(a.account_balance),2) AS `Average Account Balance`
FROM customers c
JOIN accounts a
    ON c.customer_id = a.customer_id
GROUP BY c.city
ORDER BY `Customer Count Per City` DESC
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

In [13]:
#Q2: Which account type (Savings, Current, Loan, etc.) holds the highest total balance?
query = """
SELECT
c.account_type,
SUM(a.account_balance) AS total_balance
FROM banksight.customers c
JOIN banksight.accounts a
    ON c.customer_id = a.customer_id
GROUP BY c.account_type
ORDER BY total_balance DESC;

"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

  account_type total_balance
0      Savings   61880483.18
1      Current   61617575.41

In [14]:
# Q3: Who are the top 10 customers by total account balance across all account types?
query = """
SELECT
c.customer_id,
c.name,
sum(a.account_balance) AS total_balance
FROM banksight.customers c
JOIN banksight.accounts a
    ON c.customer_id = a.customer_id
GROUP BY c.customer_id
ORDER BY total_balance DESC
Limit 10;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

  customer_id                name total_balance
0       C0314          Amy Nguyen     498739.49
1       C0011     Carolyn Higgins     498317.41
2       C0111        Lisa Russell     497040.60
3       C0392      Amber Williams     494779.97
4       C0077         Audrey Peck     494699.91
5       C0499       Alvin Compton     484758.19
6       C0338  Sharon Bennett DVM     482746.37
7       C0317     Denise Campbell     481746.58
8       C0220       Jeffrey Smith     481568.14
9       C0146          Ann Crosby     479706.41

In [15]:
# Q4: Which customers opened accounts in 2023 with a balance above â‚¹1,00,000?

query = """
SELECT 
c.customer_id,
c.name,
c.join_date,
a.account_balance
FROM banksight.customers c
JOIN banksight.accounts a 
    ON c.customer_id = a.customer_id
WHERE c.join_date >= '2023-01-01'
AND c.join_date < '2024-01-01'
AND a.account_balance > 100000;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

    customer_id             name  join_date account_balance
0         C0001   Richard Wilson 2023-08-27       293729.87
1         C0002     Holly Parker 2023-12-08       150735.15
2         C0007   Jasmine Morris 2023-10-09       291736.90
3         C0017  Jesus Davenport 2023-06-07       345239.48
4         C0021    William Jones 2023-04-01       185053.68
..          ...              ...        ...             ...
108       C0478     Ryan Jackson 2023-04-18       400751.68
109       C0484      Rodney Cruz 2023-03-09       150039.17
110       C0489    Andrea Austin 2023-01-28       407686.39
111       C0499    Alvin Compton 2023-06-16       484758.19
112       C0500     Emily Brooks 2023-10-11       454127.94

[113 rows x 4 columns]

In [16]:
# Q5: What is the total transaction volume (sum of amounts) by transaction type?

query = """
SELECT txn_type, sum(amount) as `Total Transaction Amount`
from 
transaction
GROUP BY txn_type
ORDER BY `Total Transaction Amount` DESC ;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

       txn_type Total Transaction Amount
0       deposit             197574827.47
1    withdrawal             151387322.23
2      purchase              73834033.60
3      transfer              50592799.65
4  online fraud              23829502.21

In [17]:
# Q6: How many failed transactions occurred for each transaction type?

query = """
SELECT txn_type, count(*) as `Failed Transaction`
from 
transaction
where status = 'failed'
GROUP BY txn_type
ORDER BY  `Failed Transaction` DESC ;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

       txn_type  Failed Transaction
0  online fraud                 489
1       deposit                 433
2    withdrawal                 314
3      purchase                 167
4      transfer                  94

In [18]:
# Q7: What is the total number of transactions per transaction type?

query = """
SELECT txn_type, count(*) as `Transaction`
from 
transaction
GROUP BY txn_type
ORDER BY  `Transaction` DESC ;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

       txn_type  Transaction
0       deposit         3921
1    withdrawal         3065
2      purchase         1513
3      transfer         1012
4  online fraud          489

In [19]:
# Q8: Which accounts have 5 or more high-value transactions above â‚¹20,000?

query = """
SELECT 
    customer_id, 
    count(*) AS transaction_count
from 
transaction
where amount >= 20000 
GROUP BY customer_id
HAVING count(*) >= 5;

"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

    customer_id  transaction_count
0         C0001                 16
1         C0002                  9
2         C0003                 15
3         C0004                 11
4         C0005                 11
..          ...                ...
495       C0496                 25
496       C0497                 17
497       C0498                 13
498       C0499                 17
499       C0500                 11

[500 rows x 2 columns]

In [20]:
# Q9: What is the average loan amount and interest rate by loan type (Personal, Auto, Home, etc.)?

query = """
select 
Loan_Type,
AVG(`Loan_Amount`) as `Average Loan Amount`,
AVG(`Interest_Rate`) as `Average Interest Rate` from banksight.loans
GROUP BY Loan_Type;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

   Loan_Type  Average Loan Amount Average Interest Rate
0   Personal         2.461544e+06             10.463391
1   Business         2.793969e+06             10.625437
2       Auto         2.399261e+06             10.532523
3       Home         2.344577e+06             10.872479
4  Education         2.393948e+06             10.114393

In [21]:
#Q10: Which customers currently hold more than one active or approved loan?

query = """
 SELECT 
    `Customer_ID`,
    COUNT(*) AS active_approved_loan_count
FROM banksight.loans
WHERE `Loan_Status` IN ('Active', 'Approved')
GROUP BY `Customer_ID`
HAVING COUNT(*) > 1;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

   Customer_ID  active_approved_loan_count
0         1411                           3
1         1383                           3
2         1073                           2
3         1059                           2
4         1430                           2
5         1292                           3
6         1216                           2
7         1359                           2
8         1231                           4
9         1155                           2
10        1020                           2
11        1249                           3
12        1088                           3
13        1462                           2
14        1146                           2
15        1531                           2
16        1565                           2
17        1481                           2
18        1101                           2
19        1180                           3
20        1317                           2
21        1378                           2
22        1551                           2
23        1460                           2
24        1470                           3
25        1455                           3
26        1126                           2
27        1580                           2
28        1488                           3
29        1549                           2
30        1408                           2
31        1325                           3
32        1528                           2
33        1587                           2
34        1405                           2
35        1308                           2
36        1386                           2
37        1209                           2
38        1275                           2
39        1236                           2
40        1363                           2
41        1108                           2
42        1502                           3
43        1010                           4
44        1284                           2
45        1162                           2
46        1123                           2
47        1382                           3
48        1263                           2
49        1420                           2
50        1132                           2
51        1364                           2
52        1005                           2
53        1270                           2
54        1495                           2
55        1255                           2

In [22]:
#Q11: Who are the top 5 customers with the highest outstanding (non-closed) loan amounts?

query = """
SELECT 
`customer_id`,
COUNT(*) AS total_loans,
SUM(`loan_amount`) AS total_outstanding_amount
FROM banksight.loans
WHERE `Loan_Status` <> 'Closed'
GROUP BY `customer_id`
ORDER BY total_outstanding_amount DESC
LIMIT 5;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

  customer_id  total_loans  total_outstanding_amount
0        1455            4                15389458.0
1        1383            3                13279523.0
2        1088            3                11960853.0
3        1236            4                11783260.0
4        1010            5                11747032.0

In [23]:
#Q12: What is the average loan amount per branch?

query = """
select 
`Branch`,
AVG(`Loan_Amount`) as `Average Loan Amount By Branch`
 from banksight.loans
GROUP BY `Branch`
ORDER BY  `Average Loan Amount By Branch` DESC;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

                                     Branch  Average Loan Amount By Branch
0          Johnson, Arias and Kramer Branch                      4995813.0
1         Lopez, Santana and Johnson Branch                      4987450.0
2    Williams, Mcfarland and Alvarez Branch                      4966720.0
3                       Rogers Group Branch                      4890404.0
4                       Burke-Moreno Branch                      4864325.0
..                                      ...                            ...
339          Lee, Escobar and Torres Branch                       206282.0
340                        Black Inc Branch                       157126.0
341                    Russell-Patel Branch                       131137.0
342                   Johnson-Hunter Branch                        93465.0
343                      Garcia-Kane Branch                        59655.0

[344 rows x 2 columns]

In [24]:
#Q13: How many customers exist in each age group (e.g., 18â€“25, 26â€“35, etc.)?

query = """
select 
  CASE
    WHEN `age` BETWEEN 18 AND 25 THEN '18â€“25'
    WHEN `age` BETWEEN 26 AND 35 THEN '26â€“35'
    WHEN `age` BETWEEN 36 AND 45 THEN '36â€“45'
    WHEN `age` BETWEEN 46 AND 55 THEN '46â€“55'
    WHEN `age` BETWEEN 56 AND 65 THEN '56â€“65'
    ELSE '66+'
  END AS `age_group`,
count(*) as `Count of Each Age`
from banksight.customers
GROUP BY `age_group`
order by `age_group`

"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

  age_group  Count of Each Age
0     18â€“25                 79
1     26â€“35                 75
2     36â€“45                101
3     46â€“55                100
4     56â€“65                 97
5       66+                 48

In [25]:
#Q14: Which issue categories have the longest average resolution time?

query = """
SELECT 
    `Issue_Category`,
    AVG(DATEDIFF(`Date_Closed`, `Date_Opened`)) AS `Average Resolution Days`
FROM banksight.support_tickets
WHERE 
    `Date_Closed` IS NOT NULL
    AND `status` = 'Closed'
GROUP BY `Issue_Category`
HAVING AVG(DATEDIFF(`Date_Closed`, `Date_Opened`)) IS NOT NULL
ORDER BY `Average Resolution Days` DESC;
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

                   Issue_Category Average Resolution Days
0              UPI Payment Failed                 22.0000
1       Debit Card Delivery Delay                 21.8889
2   Mismatch in Account Statement                 19.2857
3              Loan Payment Delay                 18.8667
4                Loan Foreclosure                 17.4118
5          Online Transfer Failed                 17.0000
6           Interest Rate Dispute                 17.0000
7         Account Closure Request                 17.0000
8            Account Access Issue                 15.0000
9           EMI Auto-debit Failed                 14.5714
10                 Account Frozen                 14.2500
11       Unauthorized Transaction                 14.1429
12            KYC Update Required                 11.6667
13               Card Not Working                  9.0000
14                  Cheque Bounce                  7.5000

In [ ]:
#Q15: Which support agents have resolved the most critical tickets with high customer ratings (â‰¥4)?

query = """
select `Support_Agent`,count(*) as `Critical Ticket Resolved` from banksight.support_tickets
where `Priority` = 'Critical' and `status` = 'Resolved' and `Customer_Rating` >= 4
group by `Support_Agent`
order by `Critical Ticket Resolved` DESC
"""
connection = get_connection()
try:
    with connection.cursor() as cursor:
        cursor.execute(query)
        rows = cursor.fetchall()
        df = pd.DataFrame(rows)
finally:
    connection.close()
df

      Support_Agent  Critical Ticket Resolved
0      Owen Mahajan                         2
1     Chanakya Natt                         2
2        Veda Samra                         1
3  Wriddhish Sarraf                         1
4     Gabriel Mutti                         1
5       Vansha Sood                         1
6      Advik Bhagat                         1